[{"model": "webpages.articles", "pk": 1, "fields": {"name": "TRANSFER FUNCTION REPRESENTATION", "title1": "TRANSFER FUNCTION REPRESENTATION", "quickintro": "Block diagrams consist of a single block or a combination of blocks. These are used to represent the control systems in pictorial form. The basic elements of a block diagram are a block, the summing point and the take-off point.", "intro": "Block diagrams consist of a single block or a combination of blocks. These are used to represent the control systems in pictorial form. The basic elements of a block diagram are a block, the summing point and the take-off point. Let us consider the block diagram of a closed loop control system as shown in the following figure to identify these elements.", "image1": "images/Capture0_ztd2BhU.PNG", "body1": "The transfer function of a component is represented by a block. Block has single input and \r\nsingle output. Summing Point.\r\nThe summing point is represented with a circle having cross (X) inside it. It has two or more inputs and single output. It produces the algebraic sum of the inputs. It also performs the \r\nsummation or subtraction or combination of summation and subtraction of the inputs based on the polarity of the inputs. Let us see these three operations one by one", "image2": "images/tempsnip_AIdXeKO.png", "title2": "Block Diagrams", "body2": "The above block diagram consists of two blocks having transfer functions G(s) and H(s). It is also having one summing point and one take-off point. Arrows indicate the direction of the flow of signals. Let us now discuss these elements one by one.", "conc": "Block diagram algebra is nothing but the algebra involved with the basic elements of the block diagram. This algebra deals with the pictorial representation of algebraic equations.", "date_posted": "2023-09-29"}}, {"model": "webpages.articles", "pk": 2, "fields": {"name": "Logic Gates", "title1": "Logic Gates", "quickintro": "A logic gate is an idealized model of computation or physical \r\nelectronic device implementing a Boolean function", "intro": "A logic gate is an idealized model of computation or physical \r\nelectronic device implementing a Boolean function A logic gate is an idealized model of computation or physical \r\nelectronic device implementing a Boolean function", "image1": "images/tempsnip2_4SDKDq6.png", "body1": "An AND gate possesses two or more inputs and a single \r\noutput. The output of an AND gate is in 1 if and only if all the \r\ninputs assume the state 1. Consequently an AND gate is also \r\nreferred to as a coincidence circuit. The operation of an AND \r\ncan be given in 𝑇𝑎𝑏𝑙𝑒 2. Here 0 volt and 5 volt represent the \r\nstates 0 and 1 respectively", "image2": "images/tempsnip1_hUZxzQ0.png", "title2": "AND Gate:", "body2": "Truth table of AND Gate\r\nA diode logic configuration of two input AND gate for positive \r\nlogic circuit. Here A and B are two inputs and y the output of \r\nAND gate.", "conc": "An AND gate requires all inputs to be high (1) for the output Y to be True.", "date_posted": "2023-09-29"}}, {"model": "webpages.articles", "pk": 3, "fields": {"name": "Cellular Telephone", "title1": "Cellular Telephone", "quickintro": "Cellular telephones were developed in the 1980s and rapidly became popular in the 1990s. Today’s cell phones contain a great deal of sophisticated features", "intro": "Cellular telephones were developed in the 1980s and rapidly became popular in the 1990s. Today’s cell phones contain a great deal of sophisticated analog and digital electronics that\r\nlie well beyond the scope of this book. But our objective here is to see how the concepts described in this book prove relevant to the operation of a cell phone.\r\nCellular Telephone", "image1": "images/tempsnip3_UD9gTru.png", "body1": "Suppose you are speaking with a friend on your cell phone. Your voice is converted to an electric signal by a microphone and, after some processing, transmitted by the antenna. The signal produced by your antenna is picked up by your friend’s receiver and, after some processing, applied to the speaker. What goes on in these black boxes? Why are they needed?", "image2": "images/tempsnip4_zIKwA6H.png", "title2": "Multiplication of a voice signal by a sinusoid", "body2": "Let us attempt to omit the black boxes and construct the simple system shown. How well does this system work? We make two observations. First, our voice contains frequencies from 20 Hz to 20 kHz (called the “voice band”). Second, for an antenna to operate efficiently, i.e., to convert most of the electrical signal to electromagnetic radiation, its dimension must be a significant fraction (e.g., 25%) of the wavelength. Unfortunately, a frequency range of 20 Hz to 20 kHz translates to a wavelength1 of 1.5 × 107m to 1.5 × 104 m, requiring gigantic antennas for each cell phone. Conversely, to obtain a reasonable antenna length, e.g., 5 cm, the wavelength must be around 20 cm and the frequency around 1.5 GHz.", "conc": "How do we “convert” the voice band to a gigahertz center frequency? One possible approach is to multiply the voice signal, x(t), by a sinusoid, A cos(2πfct) [Fig. 1.2(a)]. Since\r\nmultiplication in the time domain corresponds to convolution in the frequency domain, and since the spectrum of the sinusoid consists of two impulses at ±fc, the voice spectrum is simply shifted (translated) to ±fc [Fig. 1.2(b)]. Thus, if fc = 1 GHz, the output occupies a bandwidth of 40 kHz centered at 1 GHz. This operation is an example of “amplitude modulation.\r\nsnip3,4", "date_posted": "2022-11-07"}}, {"model": "webpages.articles", "pk": 4, "fields": {"name": "The Look-Ahead –Carry Adder", "title1": "The Look-Ahead –Carry Adder", "quickintro": "In parallel-adder, the speed with which an addition can be performed is governed by the time required for the carries to propagate or ripple through all of the stages of the adder.", "intro": "In parallel-adder, the speed with which an addition can be performed is governed by the time required for the carries to propagate or ripple through all of the stages of the adder. The look-ahead carry adder speeds up the process by eliminating this ripple carry delay. It examines all the input bits simultaneously and also generates the carry-in bits for all the stages simultaneously.", "image1": "images/tempsnip5_ZbYt8Tq.png", "body1": "The method of speeding up the addition process is based on the two additional functions of the full-adder, called the carry generate and carry propagate functions.\r\nConsider one full adder stage; say the nth stage of a parallel adder as shown in fig. we know that is made by two half adders and that the half adder contains an X-OR gate to produce the sum and an AND gate to produce the carry. If both the bits An and Bn are 1s, a carry has to be generated in this stage regardless of whether the input carry Cin is a 0 or a 1. This is called generated carry, expressed as Gn= An.Bn which has to appear at the output through the OR gate as shown in fig.", "image2": "images/tempsnip6_nDAcSD9.png", "title2": "A Full Adder", "body2": "Thereis another possibility of producing a carry out. X-OR gate inside the half-adder at the input produces an intermediary sum bit- call it Pn –which is expressed as P = An XOR Bn . Next Pn and Cn are added using the X-OR gate inside the second half adder to produce the final\r\n38 sum bit and and output carryC0= Pn.Cn=( )Cn which \r\nbecomes carry for the (n+1) th stage. Consider the case of both Pn and Cn being 1. The input carry Cn has to be propagated to the output only if Pn is 1. If Pn is 0, even if Cn is 1, the and gate in the second half-adder will inhibit Cn . the carry out of the nth stage is 1 when either Gn=1 or Pn.Cn =1 or both Gn and Pn.Cn are equal to 1.", "conc": "The final output carry is expressed as a function of the \r\ninput variables in SOP form. Which is two level AND-OR or equivalent NAND-NAND form. Observe that the full look-ahead scheme requires the use of OR gate with (n+1) inputs and AND gates with number of inputs varying from 2 to (n+1).", "date_posted": "2021-12-14"}}, {"model": "webpages.articles", "pk": 5, "fields": {"name": "Synchronous and Asynchronous Operation", "title1": "Synchronous and Asynchronous Operation", "quickintro": "Sequential circuits are divided into two main types: synchronous and asynchronous. Their classification depends on the timing of their signals.", "intro": "Sequential circuits are divided into two main types: synchronous and asynchronous. Their classification depends on the timing of their signals. Synchronous sequential circuits change their states and output values at discrete instants of time, which are specified by the rising and falling edge of a free-running clock signal. The clock signal is generally some form of square wave as shown in Figure below.", "image1": "images/tempsnip7_IUQO1VO.png", "body1": "Synchronous and Asynchronous Operation\r\nFrom the diagram you can see that the clock period is the time between successive transitions in the same direction, that is, between two rising or two falling edges. State transitions in synchronous sequential circuits are made to take place at times when the clock is making a transition from 0 to 1 (rising edge) or from 1 to 0 (falling edge).", "image2": "images/tempsnip8_K00cQoQ.png", "title2": "Clock Signal", "body2": "Between successive clock pulses there is no change in the information stored in memory. The reciprocal of the clock period is referred to as the clock frequency. The clock width \r\nis defined as the time during which the value of the clock signal is equal to 1. The ratio of the clock width and clock period is referred to as the duty cycle. A clock signal is said to be active high if the state changes occur at the clock's rising edge or during the clock width. Otherwise, the clock is said to be active low. Synchronous sequential circuits are also known as clocked sequential circuits.\r\nThe memory elements used in synchronous sequential circuits are usually flip-flops. These circuits are binary cells capable of storing one bit of information. A flip-flop circuit has two \r\noutputs, one for the normal value and one for the complement value of the bit stored in it. Binary information can enter a flip-flop in a variety of ways, a fact which give rise to the different types of flip-flops. For information on the different types of basic flip-flop circuits and their logical \r\nproperties, see the previous tutorial on flip-flops.", "conc": "In asynchronous sequential circuits, the transition from one state to another is initiated by the change in the primary inputs; there is no external synchronization. The memory commonly used in asynchronous sequential circuits are time-delayed devices, usually implemented by feedback among logic gates. Thus, asynchronous sequential circuits may be regarded as combinational circuits with feedback. Because of the feedback among logic gates, asynchronous sequential \r\ncircuits may, at times, become unstable due to transient conditions. The instability problem imposes many difficulties on the designer. Hence, they are not as commonly used as synchronous systems.", "date_posted": "2022-07-18"}}, {"model": "webpages.articles", "pk": 6, "fields": {"name": "What is Management System?", "title1": "What is Management System?", "quickintro": "A database-management system (DBMS) is a collection of interrelated data and a set of programs to access those data.", "intro": "A database-management system (DBMS) is a collection of interrelated data and a set of programs to access those data. This is a collection of related data with an implicit meaning and hence is a database. The collection of data, usually referred to as the database, contains information relevant to an enterprise. The primary goal of a DBMS is to provide a way to store and retrieve database information that is both convenient and efficient. By data, we mean known facts that can be recorded and that have implicit meaning.", "image1": "images/tempsnip9_sGptHHz.png", "body1": "What is Management System?\r\n\r\n\r\nThe management system is important because without the existence of some kind of rules and regulations it is not possible to maintain the database. We have to select the particular attributes which should be included in a particular table; the common attributes to create relationship between two tables; if a new record has to be inserted or deleted then which tables should have to be handled etc. These issues must be resolved by having some kind of rules to follow in order to maintain the integrity of the database.", "image2": "images/tempsnip10_ljrbsGy.png", "title2": "Levels of Abstraction in a DBMS", "body2": "Database systems are designed to manage large bodies of information. Management of data involves both defining structures for storage of information and providing mechanisms for the manipulation of information. In addition, the database system must ensure the safety of the information stored, despite system crashes or attempts at unauthorized access. If data are to be shared among several users, the system must avoid possible anomalous results.", "conc": "Because information is so important in most organizations, computer scientists have developed a large body of concepts and techniques for managing data. These concepts and technique form the focus of this book.", "date_posted": "2023-02-28"}}, {"model": "webpages.usercomments", "pk": 1, "fields": {"name": "Ablo Genie", "date_posted": "2023-09-29", "comnt": "I love it!!", "relatedarticle": 1}}, {"model": "webpages.usercomments", "pk": 2, "fields": {"name": "Yondu", "date_posted": "2023-09-29", "comnt": "Haha!!", "relatedarticle": 3}}, {"model": "webpages.usercomments", "pk": 3, "fields": {"name": "Kofi Badu", "date_posted": "2023-10-02", "comnt": "This is so cool!!", "relatedarticle": 1}}, {"model": "webpages.usercomments", "pk": 4, "fields": {"name": "Adwoa", "date_posted": "2023-10-02", "comnt": "Wow!!", "relatedarticle": 2}}, {"model": "webpages.usercomments", "pk": 5, "fields": {"name": "kk", "date_posted": "2023-10-02", "comnt": "Wow, awesome!!", "relatedarticle": 2}}, {"model": "webpages.usercomments", "pk": 9, "fields": {"name": "Abel Amarteifio", "date_posted": "2023-10-02", "comnt": "wow, I did it.", "relatedarticle": 2}}, {"model": "webpages.usercomments", "pk": 10, "fields": {"name": "ama bonsu", "date_posted": "2023-10-02", "comnt": "Yesu!!", "relatedarticle": 3}}, {"model": "webpages.usercomments", "pk": 11, "fields": {"name": "Yaw Badu", "date_posted": "2023-10-02", "comnt": "Great content", "relatedarticle": 5}}, {"model": "webpages.usercomments", "pk": 15, "fields": {"name": "Gwen", "date_posted": "2023-10-02", "comnt": "Thanks", "relatedarticle": 5}}]